In [1]:
import pandas as pd

In [2]:
data_frame =pd.read_excel(r'C:\Users\LENOVO\Desktop\Naresh IT\26th - Pandas\Book1.xlsx')
print(data_frame)

                                            Address       Date      Time
0     N-101,Newtown,Electronic City,Banglore,560100 2022-04-03  08:30:21
1  A-39,Vivekananda Road,Girish Park,Kolkata,700006 2022-04-02  05:30:21

In [3]:
# Split the Address into Street No, Street Name, Area, City, ZipCode
data_frame[['Street No','Street Name','Area','City','ZipCode']]=data_frame['Address'].str.split(',',expand=True)

In [4]:
# Drop the original 'Address' column
data_frame.drop(columns=['Address'], inplace=True)

In [5]:
data_frame

,Date,Time,Street No,Street Name,Area,City,ZipCode
0,2022-04-03,08:30:21,N-101,Newtown,Electronic City,Banglore,560100
1,2022-04-02,05:30:21,A-39,Vivekananda Road,Girish Park,Kolkata,700006

In [6]:
# Split the Date into Date, Month, Year
data_frame[['date','month','year']]=data_frame['Date'].astype(str).str.split('-',expand=True)

In [7]:
# Drop the original 'Date' column
data_frame.drop(columns=['Date'], inplace=True)

In [8]:
data_frame

,Time,Street No,Street Name,Area,City,ZipCode,date,month,year
0,08:30:21,N-101,Newtown,Electronic City,Banglore,560100,2022,04,03
1,05:30:21,A-39,Vivekananda Road,Girish Park,Kolkata,700006,2022,04,02

In [9]:
# Split the Time into Hours, Minutes, Seconds
data_frame[['hours','min','sec']]=data_frame['Time'].astype(str).str.split(':',expand=True)

In [10]:
# Drop the original 'Time' column
data_frame.drop(columns=['Time'], inplace=True)

In [11]:
data_frame

,Street No,Street Name,Area,City,ZipCode,date,month,year,hours,min,sec
0,N-101,Newtown,Electronic City,Banglore,560100,2022,04,03,08,30,21
1,A-39,Vivekananda Road,Girish Park,Kolkata,700006,2022,04,02,05,30,21